<script lang="ts">
  import SvelteMarkdown from "svelte-markdown";
  import GithubLink from "@components/GithubLink.svelte";

  const text = `
# Система уведомлений студентов о задолженностях
Учебный проект в рамках магистратуры.  
Основная задача - автоматизация процесса уведомлений студентов о задолженностях по оплате.

## Генерация уведомлений
На основе входных данных:  

1. Общая таблица (excel);

|      id       | Время создания |      ФИО      |    Группа     | Регистрационный номер  | Номер договора | Условия оплаты  | Адрес проживания | Почтовый индекс | Телефон |  Почта  |
| ------------- | -------------- | ------------- | ------------- | ---------------------- | -------------- | --------------- | ---------------- | --------------- | ------- | ------- |
|      int      |    DateTime    |    string     |    string     |         string         |     string     |     string      |      string      |      string     |  string | string  |

2. Таблица должников (excel);

|  ФИО   | Номер договора | Дата начала долга | Сумма |
| ------ | -------------- | ----------------- | ----- |
| string |     string     |      DateTime     |  int  |

3. Текст шаблона (word).

\`\`\`
Текст должен включать ключевые слова, которые будет заменены на поля из таблиц. Такие слова пишутся капсом и разделяются точками.
Например .ФИО., .СУММА-ДОЛГА., .НОМЕР-ГРУППЫ., .НОМЕР-ДОГОВОРА. и тд.
\`\`\`

На основе входных данных можно генерировать уведомления, где каждая страница будет соответствовать каждому должнику из таблицы (п. 2). На основе шаблона (п. 3) с данными из общей таблицы (п. 1).

Пример текста на основе шаблона (п. 3).
\`\`\`
Текст должен включать ключевые слова, которые будет заменены на поля из таблиц. Такие слова пишутся капсом и разделяются точками.
Например .Матвеев Андрей Александрович., .120000., .РИМ-220990., .РТФ2022-*********. и тд.
\`\`\`

Таким образом вместо ручного заполнения кучи word файлов можно в несколько действий сгенерировать уведомления готовые к печати.

## Генерация черновиков для рассылки по почте

На основе входных данных:
1. Логин;
2. [App password](https://myaccount.google.com/apppasswords);
3. Текст заголовка;
4. Текст тела письма;
5. Сканы подписанных уведомлений.

Документы после печати подписываются и сканируются. Чтобы не разбивать pdf на большое количество файлов и вручную не составлять письма можно загрузить перечисленные данные в форму.  
   
С помощью tesseract ocr идет чтение текста pdf файла. В готовом тексте с помощью регулярных выражений можно найти номер договора. И по номеру договора найти запись о студенте в БД. На основе записи студента можно создать черновик в гугл почте, заполнить адресата, из формы взять текст заголовка и тела сообщения, а также приложить скан уведомления.
  
P.S. Проект командный, frontend - разрабатывал другой человек.`;
</script>

<div>
  <div>
    <SvelteMarkdown source={text} />
  </div>
  <div>
    <GithubLink
      url="https://github.com/andrewmat2000/urfu-notification-system"
    />
    Код проекта
  </div>
</div>

<style lang="scss">
  div {
    color: $theme-text-color;

    padding: 15px;

    > div:last-child {
      padding-top: 25px;
      display: flex;
      flex-direction: column;
      align-items: center;
      justify-content: center;
      border-top: $theme-white-color solid 1px;
    }

    :global(table) {
      border: 1px $theme-white-color solid;
      border-collapse: collapse;
    }

    :global(thead) {
      border-bottom: 1px $theme-white-color solid;
    }

    :global(th) {
      padding: 10px;
      border-right: 1px $theme-white-color solid;
    }

    :global(td) {
      border-right: 1px $theme-white-color solid;
    }
  }
</style>
